app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("nombre", "contenido", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create

    @blog = Blog.new(blog_params)
    @blog.user_id = current_user.id

    respond_to do |format|
      if @blog.save