app/controllers/offers_controller.rb

  def index
    @offers = Offer.all
---
SELECT "offers".* FROM "offers"

  def create
    @offer = Offer.new(offer_params)

    respond_to do |format|
      if @offer.save
---
INSERT INTO "offers" ("tipo", "nombre_cargo", "tipo_contrato", "salario_float", "objetivo", "educacion_minima", "experiencia", "idiomas", "programas", "conocimientos_especificos", "disponibilidad_viajar", "disponibilidad_residencia", "vacantes", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @offer.update(offer_params)
---
UPDATE "offers" SET "tipo" = ?, "experiencia" = ?, "updated_at" = ? WHERE "offers"."id" = ?  [["tipo", "Publico"], ["experiencia", 3], ["updated_at", "2018-11-15 19:49:14.310091"], ["id", 6]]

    def set_offer
      @offer = Offer.find(params[:id])
---
SELECT  "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]