app/controllers/recognitions_controller.rb

SELECT "recognitions".* FROM "recognitions" WHERE "recognitions"."user_id" = ? ORDER BY "recognitions"."created_at" DESC  [["user_id", 1]]
---
	def list
		@recognitions = current_user.recognitions.order(created_at: :desc)

INSERT INTO "recognitions" ("image", "analisis", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
	def analyze_photo
		visual_recognition = IBMWatson::VisualRecognitionV3.new(
		  version: "2018-03-19",
		  iam_apikey: "nsOM3ic0C_7ZmGwKlaEPC0KgJZVH2xbjVQkNa9Y-J8yY"
		)

		File.open(save_image(params[:image])) do |image_file|
  			face_result = visual_recognition.detect_faces(images_file: image_file).result
  			image = Recognition.new(:image => params[:image], :analisis => face_result, :user_id => current_user.id)

  			if image.save