app/controllers/texts_controller.rb

SELECT "texts".* FROM "texts" WHERE "texts"."user_id" = ? ORDER BY "texts"."created_at" DESC  [["user_id", 1]]
---
	def list
		@texts = current_user.texts.order(created_at: :desc)

INSERT INTO "texts" ("texto", "user_id", "created_at", "updated_at", "emocion", "status") VALUES (?, ?, ?, ?, ?, ?)  [["texto", "te odio"], ["user_id", 1], ["created_at", "2018-11-06 13:34:20.260071"], ["updated_at", "2018-11-06 13:34:20.260071"], ["emocion", "frustrado"], ["status", "0"]]
---
	def create
		variables = traduce_text(params[:text][:texto])
		texto = current_user.texts.new(:texto => variables[0],
							   :emocion => variables[1],
							   :status => variables[2])

		if texto.save