app/controllers/tones_controller.rb

SELECT "recordings".* FROM "recordings" WHERE "recordings"."user_id" = ? ORDER BY "recordings"."created_at" DESC  [["user_id", 1]]
---
	def list
		@recordings = current_user.recordings.order(created_at: :desc)